Tekla Open API Reference for Tekla Structures 2025
RebarComplexGeometry Properties
The RebarComplexGeometry type exposes the following members.
Properties
Name | Description
BendingRadiuses
 The bending radiuses of the wire.
Diameter
 Gets the diameter of the wire.
Legs
 Gets the list of RebarLegs of the bar.
Top
See Also
Reference
RebarComplexGeometry Class
Tekla.Structures.Model Namespace